/**
 * Alex Eubanks, June 2012 - endeavor at rainbowsandpwnies.com
 * The structures used for this code come from
 * https://github.com/endeav0r/Rainbows-And-Pwnies-Tools .
 * 
 * Originally (C) 2011 Alex Eubanks.
 * Released into the public domain on June 7, 2012.
 *
 * The names and values used in XML may seem large/redundant, but they
 * mirror those found in the PE specification given by Microsoft.
 *
 * For a description of the meanings of the field names below, please see
 * "Microsoft PE and COFF Specification," 
 * http://msdn.microsoft.com/en-us/library/windows/hardware/gg463119.aspx

 * Revision history:
 * 2015-april   bda - Removed requirement that pe_NumberOfRvaAndSizes, hardcoded
                      to 16, be defined, since some data was found where it was
                      0, resulting in failure to extract valid dll filenames.
 * 2015-april   bda - added PE carving.
 */
 
/**
 * XML_SPEC
 PE
 FileHeader
 @Machine =>   "IMAGE_FILE_MACHINE_AMD64"
 | "IMAGE_FILE_MACHINE_ARM"
 | "IMAGE_FILE_MACHINE_ARMV7"
 | "IMAGE_FILE_MACHINE_I386"
 | "IMAGE_FILE_MACHINE_IA64"
 @NumberOfSections     => %d
 @TimeDateStamp        => %d
 @TimeDateStampISO     => %s
 @PointToSymbolTable   => %d
 @NumberOfSymbols      => %d
 @SizeOfOptionalHeader => %d
 Characteristics
 IMAGE_FILE_RELOCS_STRIPPED  // these tags are present if
 ...                         // bits were set in
 IMAGE_FILE_BYTES_REVERSE_HI // Characteristics

#define IMAGE_SUBSYSTEM_XBOX                    14

#define IMAGE_DLL_CHARACTERISTICS_DYNAMIC_BASE          0x0040
#define IMAGE_DLL_CHARACTERISTICS_FORCE_INTEGRITY       0x0080
#define IMAGE_DLL_CHARACTERISTICS_NX_COMPAT             0x0100
#define IMAGE_DLL_CHARACTERISTICS_NO_ISOLATION          0x0200
#define IMAGE_DLL_CHARACTERISTICS_NO_SEH                0x0400
#define IMAGE_DLL_CHARACTERISTICS_NO_BIND               0x0800
#define IMAGE_DLL_CHARACTERISTICS_WDM_DRIVER            0x2000
#define IMAGE_DLL_CHARACTERISTICS_TERMINAL_SERVER_AWARE 0x8000

#define IMAGE_SCN_TYPE_REG               0x00000000
#define IMAGE_SCN_TYPE_DSECT             0x00000001
#define IMAGE_SCN_TYPE_NOLOAD            0x00000002
#define IMAGE_SCN_TYPE_GROUP             0x00000004
#define IMAGE_SCN_TYPE_NO_PAD            0x00000008
#define IMAGE_SCN_TYPE_COPY              0x00000010
#define IMAGE_SCN_CNT_CODE               0x00000020
#define IMAGE_SCN_CNT_INITIALIZED_DATA   0x00000040
#define IMAGE_SCN_CNT_UNINITIALIZED_DATA 0x00000080
#define IMAGE_SCN_LNK_OTHER              0x00000100
#define IMAGE_SCN_LNK_INFO               0x00000200
#define IMAGE_SCN_TYPE_OVER              0x00000400
#define IMAGE_SCN_LNK_REMOVE             0x00000800
#define IMAGE_SCN_LNK_COMDAT             0x00001000
#define IMAGE_SCN_MEM_FARDATA            0x00008000
#define IMAGE_SCN_MEM_PURGEABLE          0x00020000
#define IMAGE_SCN_MEM_16BIT              0x00020000
#define IMAGE_SCN_MEM_LOCKED             0x00040000
#define IMAGE_SCN_MEM_PRELOAD            0x00080000
#define IMAGE_SCN_ALIGN_1BYTES           0x00100000
#define IMAGE_SCN_ALIGN_2BYTES           0x00200000
#define IMAGE_SCN_ALIGN_4BYTES           0x00300000
#define IMAGE_SCN_ALIGN_8BYTES           0x00400000
#define IMAGE_SCN_ALIGN_16BYTES          0x00500000
#define IMAGE_SCN_ALIGN_32BYTES          0x00600000
#define IMAGE_SCN_ALIGN_64BYTES          0x00700000
#define IMAGE_SCN_ALIGN_128BYTES         0x00800000
#define IMAGE_SCN_ALIGN_256BYTES         0x00900000
#define IMAGE_SCN_ALIGN_512BYTES         0x00A00000
#define IMAGE_SCN_ALIGN_1024BYTES        0x00B00000
#define IMAGE_SCN_ALIGN_2048BYTES        0x00C00000
#define IMAGE_SCN_ALIGN_4096BYTES        0x00D00000
#define IMAGE_SCN_ALIGN_8192BYTES        0x00E00000
#define IMAGE_SCN_LNK_NRELOC_OVFL        0x01000000
#define IMAGE_SCN_MEM_DISCARDABLE        0x02000000
#define IMAGE_SCN_MEM_NOT_CACHED         0x04000000
#define IMAGE_SCN_MEM_NOT_PAGED          0x08000000
#define IMAGE_SCN_MEM_SHARED             0x10000000
#define IMAGE_SCN_MEM_EXECUTE            0x20000000
#define IMAGE_SCN_MEM_READ               0x40000000
#define IMAGE_SCN_MEM_WRITE              0x80000000

#define IMAGE_FILE_TYPE_PE32     0x10b
#define IMAGE_FILE_TYPE_PE32PLUS 0x20b

#define PE_SECTION_RESERVED_FLAGS 0x00000417

/* For information on __attribute__((packed)), see:
 * http://gcc.gnu.org/onlinedocs/gcc-3.2/gcc/Type-Attributes.html
 */

// tunable parameter
static uint32_t winpe_carve_mode = feature_recorder::CARVE_ENCODED;

typedef struct _Pe_Fileheader {
    uint16_t Machine              __attribute__((packed));
    uint16_t NumberOfSections     __attribute__((packed));
    uint32_t TimeDateStamp        __attribute__((packed));
    uint32_t PointerToSymbolTable __attribute__((packed));
    uint32_t NumberOfSymbols      __attribute__((packed));
    uint16_t SizeOfOptionalHeader __attribute__((packed));
    uint16_t Characteristics      __attribute__((packed));
} __attribute__((packed)) Pe_FileHeader;

typedef struct _Pe_OptionalHeaderStandard {
    uint16_t Magic;                   // 2
    uint8_t  MajorLinkerVersion;      // 3
    uint8_t  MinorLinkerVersion;      // 4
    uint32_t SizeOfCode;              // 8
    uint32_t SizeOfInitializedData;   // 12
    uint32_t SizeOfUninitializedData; // 16
    uint32_t AddressOfEntryPoint;     // 20
    uint32_t BaseOfCode;              // 24
    uint32_t BaseOfData;              // 28
} __attribute__((packed)) Pe_OptionalHeaderStandard;

typedef struct _Pe_OptionalHeaderStandardPlus {
    uint16_t Magic;                   // 2
    uint8_t  MajorLinkerVersion;      // 3
    uint8_t  MinorLinkerVersion;      // 4
    uint32_t SizeOfCode;              // 8
    uint32_t SizeOfInitializedData;   // 12
    uint32_t SizeOfUninitializedData; // 16
    uint32_t AddressOfEntryPoint;     // 20
    uint32_t BaseOfCode;              // 24
} __attribute__((packed)) Pe_OptionalHeaderStandardPlus;

typedef struct _Pe_OptionalHeaderWindows {
    uint32_t ImageBase;                   // 32
    uint32_t SectionAlignment;            // 36
    uint32_t FileAlignment;               // 40
    uint16_t MajorOperatingSystemVersion; // 42
    uint16_t MinorOperatingSystemVersion; // 44
    uint16_t MajorImageVersion;           // 46
    uint16_t MinorImageVersion;           // 48
    uint16_t MajorSubsystemVersion;       // 50
    uint16_t MinorSubsystemVersion;       // 52
    uint32_t Win32VersionValue;           // 56
    uint32_t SizeOfImage;                 // 60
    uint32_t SizeOfHeaders;               // 64
    uint32_t CheckSum;                    // 68
    uint16_t Subsystem;                   // 70
    uint16_t DllCharacteristics;          // 72
    uint32_t SizeOfStackReserve;          // 76
    uint32_t SizeOfStackCommit;           // 80
    uint32_t SizeOfHeapReserve;           // 84
    uint32_t SizeOfHeapCommit;            // 88
    uint32_t LoaderFlags;                 // 92
    uint32_t NumberOfRvaAndSizes;         // 96
} __attribute__((packed)) Pe_OptionalHeaderWindows;

typedef struct _Pe_OptionalHeaderWindowsPlus {
    uint64_t ImageBase;                   // 32
    uint32_t SectionAlignment;            // 36
    uint32_t FileAlignment;               // 40
    uint16_t MajorOperatingSystemVersion; // 42
    uint16_t MinorOperatingSystemVersion; // 44
    uint16_t MajorImageVersion;           // 46
    uint16_t MinorImageVersion;           // 48
    uint16_t MajorSubsystemVersion;       // 50
    uint16_t MinorSubsystemVersion;       // 52
    uint32_t Win32VersionValue;           // 56
    uint32_t SizeOfImage;                 // 60
    uint32_t SizeOfHeaders;               // 64
    uint32_t CheckSum;                    // 68
    uint16_t Subsystem;                   // 70
    uint16_t DllCharacteristics;          // 72
    uint64_t SizeOfStackReserve;          // 80
    uint64_t SizeOfStackCommit;           // 88
    uint64_t SizeOfHeapReserve;           // 96
    uint64_t SizeOfHeapCommit;            // 104
    uint32_t LoaderFlags;                 // 108
    uint32_t NumberOfRvaAndSizes;         // 112
} __attribute__((packed)) Pe_OptionalHeaderWindowsPlus;

typedef struct _Pe_SectionHeader {
    char Name[8];                  // 8
    uint32_t VirtualSize;          // 12
    uint32_t VirtualAddress;       // 16
    uint32_t SizeOfRawData;        // 20
    uint32_t PointerToRawData;     // 24
    uint32_t PointerToRelocations; // 28
    uint32_t PointerToLinenumbers; // 32
    uint16_t NumberOfRelocations;  // 34
    uint16_t NumberOfLinenumbers;  // 36
    uint32_t Characteristics;      // 40
} __attribute__((packed)) Pe_SectionHeader;

typedef struct _Pe_ImportDirectoryTable {
    uint32_t ImportLookupTableRVA;
    uint32_t TimeDateStamp;
    uint32_t ForwarderChain;
    uint32_t NameRVA;
    uint32_t ImportAddressTableRVA;
} Pe_ImportDirectoryTable;

std::ostream & operator << (std::ostream &os,const Pe_ImportDirectoryTable &idt){
    os << " ImportLookupTableRVA=" << idt.ImportLookupTableRVA 
       << " TimeDateStamp=" << idt.TimeDateStamp
       << " ForwarderChain=" << idt.ForwarderChain 
       << " NameRVA=" << idt.NameRVA
       << " ImportAddressTableRVA=" << idt.ImportAddressTableRVA;
    return os;
};

typedef struct _Pe_DataDirectory {
    uint32_t VirtualAddress;
    uint32_t Size;
} Pe_DataDirectory;


/** Machinery to turn bitfields into XML */
#define FLAGNAME(STR) {STR,#STR}
struct  flagnames_t {
    uint32_t flag;
    const char *name;
};

static void decode_flags (std::stringstream &xml,
